espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_emu.h
/* Bit fields for EMU RSTCAUSE */
#define _EMU_RSTCAUSE_RESETVALUE                0x00000000UL                            /**< Default value for EMU_RSTCAUSE              */
#define _EMU_RSTCAUSE_MASK                      0x0000FFFFUL                            /**< Mask for EMU_RSTCAUSE                       */
#define EMU_RSTCAUSE_POR                        (0x1UL << 0)                            /**< Power On Reset                              */
#define _EMU_RSTCAUSE_POR_SHIFT                 0                                       /**< Shift value for EMU_POR                     */
#define _EMU_RSTCAUSE_POR_MASK                  0x1UL                                   /**< Bit mask for EMU_POR                        */
#define _EMU_RSTCAUSE_POR_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_POR_DEFAULT                (_EMU_RSTCAUSE_POR_DEFAULT << 0)        /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_PIN                        (0x1UL << 1)                            /**< Pin Reset                                   */
#define _EMU_RSTCAUSE_PIN_SHIFT                 1                                       /**< Shift value for EMU_PIN                     */
#define _EMU_RSTCAUSE_PIN_MASK                  0x2UL                                   /**< Bit mask for EMU_PIN                        */
#define _EMU_RSTCAUSE_PIN_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_PIN_DEFAULT                (_EMU_RSTCAUSE_PIN_DEFAULT << 1)        /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_EM4                        (0x1UL << 2)                            /**< EM4 Wakeup Reset                            */
#define _EMU_RSTCAUSE_EM4_SHIFT                 2                                       /**< Shift value for EMU_EM4                     */
#define _EMU_RSTCAUSE_EM4_MASK                  0x4UL                                   /**< Bit mask for EMU_EM4                        */
#define _EMU_RSTCAUSE_EM4_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_EM4_DEFAULT                (_EMU_RSTCAUSE_EM4_DEFAULT << 2)        /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_WDOG0                      (0x1UL << 3)                            /**< Watchdog 0 Reset                            */
#define _EMU_RSTCAUSE_WDOG0_SHIFT               3                                       /**< Shift value for EMU_WDOG0                   */
#define _EMU_RSTCAUSE_WDOG0_MASK                0x8UL                                   /**< Bit mask for EMU_WDOG0                      */
#define _EMU_RSTCAUSE_WDOG0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_WDOG0_DEFAULT              (_EMU_RSTCAUSE_WDOG0_DEFAULT << 3)      /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_WDOG1                      (0x1UL << 4)                            /**< Watchdog 1 Reset                            */
#define _EMU_RSTCAUSE_WDOG1_SHIFT               4                                       /**< Shift value for EMU_WDOG1                   */
#define _EMU_RSTCAUSE_WDOG1_MASK                0x10UL                                  /**< Bit mask for EMU_WDOG1                      */
#define _EMU_RSTCAUSE_WDOG1_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_WDOG1_DEFAULT              (_EMU_RSTCAUSE_WDOG1_DEFAULT << 4)      /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_LOCKUP                     (0x1UL << 5)                            /**< M33 Core Lockup Reset                       */
#define _EMU_RSTCAUSE_LOCKUP_SHIFT              5                                       /**< Shift value for EMU_LOCKUP                  */
#define _EMU_RSTCAUSE_LOCKUP_MASK               0x20UL                                  /**< Bit mask for EMU_LOCKUP                     */
#define _EMU_RSTCAUSE_LOCKUP_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_LOCKUP_DEFAULT             (_EMU_RSTCAUSE_LOCKUP_DEFAULT << 5)     /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_SYSREQ                     (0x1UL << 6)                            /**< M33 Core Sys Reset                          */
#define _EMU_RSTCAUSE_SYSREQ_SHIFT              6                                       /**< Shift value for EMU_SYSREQ                  */
#define _EMU_RSTCAUSE_SYSREQ_MASK               0x40UL                                  /**< Bit mask for EMU_SYSREQ                     */
#define _EMU_RSTCAUSE_SYSREQ_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_SYSREQ_DEFAULT             (_EMU_RSTCAUSE_SYSREQ_DEFAULT << 6)     /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_DVDDBOD                    (0x1UL << 7)                            /**< HVBOD Reset                                 */
#define _EMU_RSTCAUSE_DVDDBOD_SHIFT             7                                       /**< Shift value for EMU_DVDDBOD                 */
#define _EMU_RSTCAUSE_DVDDBOD_MASK              0x80UL                                  /**< Bit mask for EMU_DVDDBOD                    */
#define _EMU_RSTCAUSE_DVDDBOD_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_DVDDBOD_DEFAULT            (_EMU_RSTCAUSE_DVDDBOD_DEFAULT << 7)    /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_DVDDLEBOD                  (0x1UL << 8)                            /**< LEBOD Reset                                 */
#define _EMU_RSTCAUSE_DVDDLEBOD_SHIFT           8                                       /**< Shift value for EMU_DVDDLEBOD               */
#define _EMU_RSTCAUSE_DVDDLEBOD_MASK            0x100UL                                 /**< Bit mask for EMU_DVDDLEBOD                  */
#define _EMU_RSTCAUSE_DVDDLEBOD_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_DVDDLEBOD_DEFAULT          (_EMU_RSTCAUSE_DVDDLEBOD_DEFAULT << 8)  /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_DECBOD                     (0x1UL << 9)                            /**< LVBOD Reset                                 */
#define _EMU_RSTCAUSE_DECBOD_SHIFT              9                                       /**< Shift value for EMU_DECBOD                  */
#define _EMU_RSTCAUSE_DECBOD_MASK               0x200UL                                 /**< Bit mask for EMU_DECBOD                     */
#define _EMU_RSTCAUSE_DECBOD_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_DECBOD_DEFAULT             (_EMU_RSTCAUSE_DECBOD_DEFAULT << 9)     /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_AVDDBOD                    (0x1UL << 10)                           /**< LEBOD1 Reset                                */
#define _EMU_RSTCAUSE_AVDDBOD_SHIFT             10                                      /**< Shift value for EMU_AVDDBOD                 */
#define _EMU_RSTCAUSE_AVDDBOD_MASK              0x400UL                                 /**< Bit mask for EMU_AVDDBOD                    */
#define _EMU_RSTCAUSE_AVDDBOD_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_AVDDBOD_DEFAULT            (_EMU_RSTCAUSE_AVDDBOD_DEFAULT << 10)   /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_IOVDD0BOD                  (0x1UL << 11)                           /**< LEBOD2 Reset                                */
#define _EMU_RSTCAUSE_IOVDD0BOD_SHIFT           11                                      /**< Shift value for EMU_IOVDD0BOD               */
#define _EMU_RSTCAUSE_IOVDD0BOD_MASK            0x800UL                                 /**< Bit mask for EMU_IOVDD0BOD                  */
#define _EMU_RSTCAUSE_IOVDD0BOD_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_IOVDD0BOD_DEFAULT          (_EMU_RSTCAUSE_IOVDD0BOD_DEFAULT << 11) /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_SETAMPER                   (0x1UL << 13)                           /**< SE Tamper event Reset                       */
#define _EMU_RSTCAUSE_SETAMPER_SHIFT            13                                      /**< Shift value for EMU_SETAMPER                */
#define _EMU_RSTCAUSE_SETAMPER_MASK             0x2000UL                                /**< Bit mask for EMU_SETAMPER                   */
#define _EMU_RSTCAUSE_SETAMPER_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_SETAMPER_DEFAULT           (_EMU_RSTCAUSE_SETAMPER_DEFAULT << 13)  /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_SESYSREQ                   (0x1UL << 14)                           /**< SE System Reset                             */
#define _EMU_RSTCAUSE_SESYSREQ_SHIFT            14                                      /**< Shift value for EMU_SESYSREQ                */
#define _EMU_RSTCAUSE_SESYSREQ_MASK             0x4000UL                                /**< Bit mask for EMU_SESYSREQ                   */
#define _EMU_RSTCAUSE_SESYSREQ_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_SESYSREQ_DEFAULT           (_EMU_RSTCAUSE_SESYSREQ_DEFAULT << 14)  /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */
#define EMU_RSTCAUSE_SELOCKUP                   (0x1UL << 15)                           /**< SE Lockup Reset                             */
#define _EMU_RSTCAUSE_SELOCKUP_SHIFT            15                                      /**< Shift value for EMU_SELOCKUP                */
#define _EMU_RSTCAUSE_SELOCKUP_MASK             0x8000UL                                /**< Bit mask for EMU_SELOCKUP                   */
#define _EMU_RSTCAUSE_SELOCKUP_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EMU_RSTCAUSE               */
#define EMU_RSTCAUSE_SELOCKUP_DEFAULT           (_EMU_RSTCAUSE_SELOCKUP_DEFAULT << 15)  /**< Shifted mode DEFAULT for EMU_RSTCAUSE       */

/* Bit fields for EMU DGIF */
#define _EMU_DGIF_RESETVALUE                    0x00000000UL                            /**< Default value for EMU_DGIF                  */
#define _EMU_DGIF_MASK                          0xE1000000UL                            /**< Mask for EMU_DGIF                           */
#define EMU_DGIF_EM23WAKEUP                     (0x1UL << 24)                           /**< EM23 Wake up Interrupt flag                 */
#define _EMU_DGIF_EM23WAKEUP_SHIFT              24                                      /**< Shift value for EMU_EM23WAKEUP              */
#define _EMU_DGIF_EM23WAKEUP_MASK               0x1000000UL                             /**< Bit mask for EMU_EM23WAKEUP                 */
#define _EMU_DGIF_EM23WAKEUP_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EMU_DGIF                   */
#define EMU_DGIF_EM23WAKEUP_DEFAULT             (_EMU_DGIF_EM23WAKEUP_DEFAULT << 24)    /**< Shifted mode DEFAULT for EMU_DGIF           */
#define EMU_DGIF_TEMP                           (0x1UL << 29)                           /**< Temperature Interrupt flag                  */
#define _EMU_DGIF_TEMP_SHIFT                    29                                      /**< Shift value for EMU_TEMP                    */
#define _EMU_DGIF_TEMP_MASK                     0x20000000UL                            /**< Bit mask for EMU_TEMP                       */
#define _EMU_DGIF_TEMP_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for EMU_DGIF                   */
#define EMU_DGIF_TEMP_DEFAULT                   (_EMU_DGIF_TEMP_DEFAULT << 29)          /**< Shifted mode DEFAULT for EMU_DGIF           */
#define EMU_DGIF_TEMPLOW                        (0x1UL << 30)                           /**< Temperature low Interrupt flag              */
#define _EMU_DGIF_TEMPLOW_SHIFT                 30                                      /**< Shift value for EMU_TEMPLOW                 */
#define _EMU_DGIF_TEMPLOW_MASK                  0x40000000UL                            /**< Bit mask for EMU_TEMPLOW                    */
#define _EMU_DGIF_TEMPLOW_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EMU_DGIF                   */
#define EMU_DGIF_TEMPLOW_DEFAULT                (_EMU_DGIF_TEMPLOW_DEFAULT << 30)       /**< Shifted mode DEFAULT for EMU_DGIF           */
#define EMU_DGIF_TEMPHIGH                       (0x1UL << 31)                           /**< Temperature high Interrupt flag             */
#define _EMU_DGIF_TEMPHIGH_SHIFT                31                                      /**< Shift value for EMU_TEMPHIGH                */
#define _EMU_DGIF_TEMPHIGH_MASK                 0x80000000UL                            /**< Bit mask for EMU_TEMPHIGH                   */
#define _EMU_DGIF_TEMPHIGH_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EMU_DGIF                   */
#define EMU_DGIF_TEMPHIGH_DEFAULT               (_EMU_DGIF_TEMPHIGH_DEFAULT << 31)      /**< Shifted mode DEFAULT for EMU_DGIF           */

/* Bit fields for EMU DGIEN */
#define _EMU_DGIEN_RESETVALUE                   0x00000000UL                            /**< Default value for EMU_DGIEN                 */
#define _EMU_DGIEN_MASK                         0xE1000000UL                            /**< Mask for EMU_DGIEN                          */
#define EMU_DGIEN_EM23WAKEUP                    (0x1UL << 24)                           /**< EM23 Wake up Interrupt enable               */
#define _EMU_DGIEN_EM23WAKEUP_SHIFT             24                                      /**< Shift value for EMU_EM23WAKEUP              */
#define _EMU_DGIEN_EM23WAKEUP_MASK              0x1000000UL                             /**< Bit mask for EMU_EM23WAKEUP                 */
#define _EMU_DGIEN_EM23WAKEUP_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_EM23WAKEUP_DEFAULT            (_EMU_DGIEN_EM23WAKEUP_DEFAULT << 24)   /**< Shifted mode DEFAULT for EMU_DGIEN          */
#define EMU_DGIEN_TEMP                          (0x1UL << 29)                           /**< Temperature Interrupt enable                */
#define _EMU_DGIEN_TEMP_SHIFT                   29                                      /**< Shift value for EMU_TEMP                    */
#define _EMU_DGIEN_TEMP_MASK                    0x20000000UL                            /**< Bit mask for EMU_TEMP                       */
#define _EMU_DGIEN_TEMP_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_TEMP_DEFAULT                  (_EMU_DGIEN_TEMP_DEFAULT << 29)         /**< Shifted mode DEFAULT for EMU_DGIEN          */
#define EMU_DGIEN_TEMPLOW                       (0x1UL << 30)                           /**< Temperature low Interrupt enable            */
#define _EMU_DGIEN_TEMPLOW_SHIFT                30                                      /**< Shift value for EMU_TEMPLOW                 */
#define _EMU_DGIEN_TEMPLOW_MASK                 0x40000000UL                            /**< Bit mask for EMU_TEMPLOW                    */
#define _EMU_DGIEN_TEMPLOW_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_TEMPLOW_DEFAULT               (_EMU_DGIEN_TEMPLOW_DEFAULT << 30)      /**< Shifted mode DEFAULT for EMU_DGIEN          */
#define EMU_DGIEN_TEMPHIGH                      (0x1UL << 31)                           /**< Temperature high Interrupt enable           */
#define _EMU_DGIEN_TEMPHIGH_SHIFT               31                                      /**< Shift value for EMU_TEMPHIGH                */
#define _EMU_DGIEN_TEMPHIGH_MASK                0x80000000UL                            /**< Bit mask for EMU_TEMPHIGH                   */
#define _EMU_DGIEN_TEMPHIGH_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_TEMPHIGH_DEFAULT              (_EMU_DGIEN_TEMPHIGH_DEFAULT << 31)     /**< Shifted mode DEFAULT for EMU_DGIEN          */

/* Bit fields for EMU SEIF */
#define _EMU_SEIF_RESETVALUE                    0x00000000UL                            /**< Default value for EMU_SEIF                  */
#define _EMU_SEIF_MASK                          0xE0000000UL                            /**< Mask for EMU_SEIF                           */
#define EMU_SEIF_TEMP                           (0x1UL << 29)                           /**< Temperature Interrupt flag                  */
#define _EMU_SEIF_TEMP_SHIFT                    29                                      /**< Shift value for EMU_TEMP                    */
#define _EMU_SEIF_TEMP_MASK                     0x20000000UL                            /**< Bit mask for EMU_TEMP                       */
#define _EMU_SEIF_TEMP_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for EMU_SEIF                   */
#define EMU_SEIF_TEMP_DEFAULT                   (_EMU_SEIF_TEMP_DEFAULT << 29)          /**< Shifted mode DEFAULT for EMU_SEIF           */
#define EMU_SEIF_TEMPLOW                        (0x1UL << 30)                           /**< Temperature Interrupt flag                  */
#define _EMU_SEIF_TEMPLOW_SHIFT                 30                                      /**< Shift value for EMU_TEMPLOW                 */
#define _EMU_SEIF_TEMPLOW_MASK                  0x40000000UL                            /**< Bit mask for EMU_TEMPLOW                    */
#define _EMU_SEIF_TEMPLOW_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EMU_SEIF                   */
#define EMU_SEIF_TEMPLOW_DEFAULT                (_EMU_SEIF_TEMPLOW_DEFAULT << 30)       /**< Shifted mode DEFAULT for EMU_SEIF           */
#define EMU_SEIF_TEMPHIGH                       (0x1UL << 31)                           /**< Temperature low Interrupt flag              */
#define _EMU_SEIF_TEMPHIGH_SHIFT                31                                      /**< Shift value for EMU_TEMPHIGH                */
#define _EMU_SEIF_TEMPHIGH_MASK                 0x80000000UL                            /**< Bit mask for EMU_TEMPHIGH                   */
#define _EMU_SEIF_TEMPHIGH_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EMU_SEIF                   */
#define EMU_SEIF_TEMPHIGH_DEFAULT               (_EMU_SEIF_TEMPHIGH_DEFAULT << 31)      /**< Shifted mode DEFAULT for EMU_SEIF           */

/* Bit fields for EMU SEIEN */
#define _EMU_SEIEN_RESETVALUE                   0x00000000UL                            /**< Default value for EMU_SEIEN                 */
#define _EMU_SEIEN_MASK                         0xE0000000UL                            /**< Mask for EMU_SEIEN                          */
#define EMU_SEIEN_TEMP                          (0x1UL << 29)                           /**< Temperature Interrupt enable                */
#define _EMU_SEIEN_TEMP_SHIFT                   29                                      /**< Shift value for EMU_TEMP                    */
#define _EMU_SEIEN_TEMP_MASK                    0x20000000UL                            /**< Bit mask for EMU_TEMP                       */
#define _EMU_SEIEN_TEMP_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EMU_SEIEN                  */
#define EMU_SEIEN_TEMP_DEFAULT                  (_EMU_SEIEN_TEMP_DEFAULT << 29)         /**< Shifted mode DEFAULT for EMU_SEIEN          */
#define EMU_SEIEN_TEMPLOW                       (0x1UL << 30)                           /**< Temperature low Interrupt enable            */
#define _EMU_SEIEN_TEMPLOW_SHIFT                30                                      /**< Shift value for EMU_TEMPLOW                 */
#define _EMU_SEIEN_TEMPLOW_MASK                 0x40000000UL                            /**< Bit mask for EMU_TEMPLOW                    */
#define _EMU_SEIEN_TEMPLOW_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EMU_SEIEN                  */
#define EMU_SEIEN_TEMPLOW_DEFAULT               (_EMU_SEIEN_TEMPLOW_DEFAULT << 30)      /**< Shifted mode DEFAULT for EMU_SEIEN          */
#define EMU_SEIEN_TEMPHIGH                      (0x1UL << 31)                           /**< Temperature high Interrupt enable           */
#define _EMU_SEIEN_TEMPHIGH_SHIFT               31                                      /**< Shift value for EMU_TEMPHIGH                */
#define _EMU_SEIEN_TEMPHIGH_MASK                0x80000000UL                            /**< Bit mask for EMU_TEMPHIGH                   */
#define _EMU_SEIEN_TEMPHIGH_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EMU_SEIEN                  */
#define EMU_SEIEN_TEMPHIGH_DEFAULT              (_EMU_SEIEN_TEMPHIGH_DEFAULT << 31)     /**< Shifted mode DEFAULT for EMU_SEIEN          */

/** @} End of group EFR32MR21_EMU_BitFields */
/** @} End of group EFR32MR21_EMU */
/** @} End of group Parts */

#endif /* EFR32MR21_EMU_H */
